Pcase_origin/Case/case0/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    floor
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    ceiling
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    sWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    nWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    sideWalls
    {
        type            empty;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;  //5 %
        value           uniform 1;
    }
    glass1
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    glass2
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    sun
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    heatsource1
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    heatsource2
    {
        type            kqRWallFunction;
        value           uniform 0.1;
    }
    Table_master
    {
        type            kqRWallFunction;
        coupleGroup     Table;
        value           uniform 0.1;
    }
    Table_slave
    {
        type            kqRWallFunction;
        coupleGroup     Table;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
